app/controllers/tasks_controller.rb

  def index
    @tasks = @task_list.tasks.all
---
SELECT * FROM `tasks` WHERE (`tasks`.task_list_id = 2)

  def show
    @task = @task_list.tasks.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2 AND (`tasks`.task_list_id = 1))

  def edit
    @task = @task_list.tasks.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2 AND (`tasks`.task_list_id = 1))

  def create
    @task = @task_list.tasks.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`status`, `updated_at`, `task_list_id`, `title`, `description`, `due_date`, `created_at`) VALUES(0, '2010-08-08 09:47:55', 2, 'test', 'test', '2008-03-04 09:47:00', '2010-08-08 09:47:55')

  def update
    @task = @task_list.tasks.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2 AND (`tasks`.task_list_id = 1))
UPDATE `tasks` SET `due_date` = '2010-09-08 09:55:00', `title` = 'test123456', `updated_at` = '2010-08-08 11:53:59' WHERE `id` = 2