app/controllers/task_lists_controller.rb

  def index
    @task_lists = @user.task_lists.all
---
SELECT * FROM `task_lists` WHERE (`task_lists`.user_id = 1)

  def show
    @task_list = @user.task_lists.find(params[:id])
---
SELECT * FROM `task_lists` WHERE (`task_lists`.`id` = 1 AND (`task_lists`.user_id = 1))

  def create
    @task_list = @user.task_lists.new(params[:task_list])

    respond_to do |format|
      if @task_list.save
---
INSERT INTO `task_lists` (`name`, `updated_at`, `user_id`, `created_at`) VALUES('test', '2010-08-08 09:02:20', 1, '2010-08-08 09:02:20')