app/controllers/users_controller.rb

INSERT INTO `users` (`city`, `postal_code`, `updated_at`, `title`, `created_by`, `phone_number`, `resident_address`, `updated_by`, `current_address`, `user_type`, `first_name`, `last_name`, `password`, `email`, `created_at`) VALUES('asd', 3333, '2010-08-08 10:40:30', 'Test', NULL, 2334, 'adsf', NULL, 'adsfs', NULL, 'Test', 'Test', 'test', 'Test@gmail.com', '2010-08-08 10:40:30')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE (email='admin@newstarit.com' and password='newstarit1') LIMIT 1
---
  def verify_login
    reset_session
    if User.table_exists?
      if not params[:login].blank?
        if not params[:login][:email].blank? and not params[:login][:password].blank?
          user_email=params[:login][:email]
          password=params[:login][:password]
          @user = User.find(:first,:conditions=>["email=? and password=?",user_email,password])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def change_password
    @user = User.find(session[:user_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def tasks
    @user=User.find(session[:user_id])